# Title Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FileDialog..::..Title Property
FileDialog Class See Also
---
The title to show on the dialog.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public string Title { get; set; }
```

Visual Basic
---
```text
Public Property Title As String
	Get
	Set
```

Visual C++
---
```text
public:
property String^ Title {
	String^ get ();
	void set (String^ value);
}
```

# ### Field Value
If not set, a default title will be used for the dialog. For open, this will be something similar to "Select File" and for save, "Save As".
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | When setting this property: title cannot include prohibited unprintable characters. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
FileDialog Class
Autodesk.Revit.UI Namespace